---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContext
source: html/a22e400a-700b-1dc3-fd62-8f1af22ffdcf.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContext Method

Returns an object containing information about the context of the load operation.

## Syntax (C#)
```csharp
public ExternalResourceLoadContext GetLoadContext()
```

## Returns
An object containing information about the context of the load operation.